src/Documents/ЗадачаСотрудника/ЗадачаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаСотрудника</name>
  <registerRecords>AccumulationRegister.НагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дистанционное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятия</name>
    <type>
      <types>EnumRef.ТипыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.УчебныеПрограммы</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/НагрузкаПреподавателей/НагрузкаПреподавателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НагрузкаПреподавателей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ЗадачаСотрудника/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Основная Тогда
	
		Месяц = ОпределитьМесяц(ДатаНачала);
			
		Если НЕ ЗначениеЗаполнено(Преподаватель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен преподаватель";
			СообщениеПользователю.Поле = "Преподаватель";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(Месяц) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен месяц";
			СообщениеПользователю.Поле = "Месяц";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);
		ЭлементБлокировки.УстановитьЗначение("Месяц", Месяц);
		Блокировка.Заблокировать();
	
		Движения.НагрузкаПреподавателей.Записывать = Истина;
		
		Движение = Движения.НагрузкаПреподавателей.Добавить();
		Движение.Период = Дата;
		Движение.Преподаватель = Преподаватель;
		Движение.Месяц = Месяц;
		Движение.Часы = 2;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьМесяц(Знач ДатаЗадачи)
	
	НомерМесяца = Месяц(ДатаЗадачи);
	
	ПеречислениеМесяцев = Перечисления.МесяцыГода;
	
	Возврат ПеречислениеМесяцев.Получить(НомерМесяца - 1);
	
КонецФункции
